dmkuzmin/stm32l1xx-hal/src/gpio.rs
                impl<MODE> $PXi<MODE> {
                    impl_into_af! {
                        $PXi $AFR $i,
                        (AF1, 1, into_af1);
                        (AF2, 2, into_af2);
                        (AF3, 3, into_af3);
                        (AF4, 4, into_af4);
                        (AF5, 5, into_af5);
                        (AF6, 6, into_af6);
                        (AF7, 7, into_af7);
                        (AF8, 8, into_af8);
                        (AF9, 9, into_af9);
                        (AF10, 10, into_af10);
                        (AF11, 11, into_af11);
                        (AF12, 12, into_af12);
                        (AF13, 13, into_af13);
                        (AF14, 14, into_af14);
                        (AF15, 15, into_af15);
                    }
                }
            )+
        }
    }
}

gpio!(GPIOA, gpioa, gpioa, gpiopaen, gpioarst, PAx, 0, [
    PA0: (pa0, 0, Input<Floating>, AFRL, exticr1),
    PA1: (pa1, 1, Input<Floating>, AFRL, exticr1),
    PA2: (pa2, 2, Input<Floating>, AFRL, exticr1),
    PA3: (pa3, 3, Input<Floating>, AFRL, exticr1),
    PA4: (pa4, 4, Input<Floating>, AFRL, exticr2),
    PA5: (pa5, 5, Input<Floating>, AFRL, exticr2),
    PA6: (pa6, 6, Input<Floating>, AFRL, exticr2),
    PA7: (pa7, 7, Input<Floating>, AFRL, exticr2),
    PA8: (pa8, 8, Input<Floating>, AFRH, exticr3),
    PA9: (pa9, 9, Input<Floating>, AFRH, exticr3),
    PA10: (pa10, 10, Input<Floating>, AFRH, exticr3),
    PA11: (pa11, 11, Input<Floating>, AFRH, exticr3),
    PA12: (pa12, 12, Input<Floating>, AFRH, exticr4),
    PA13: (pa13, 13, Input<Floating>, AFRH, exticr4),
    PA14: (pa14, 14, Input<Floating>, AFRH, exticr4),
    PA15: (pa15, 15, Input<Floating>, AFRH, exticr4),
]);

gpio!(GPIOB, gpiob, gpiob, gpiopben, gpiobrst, PBx, 1, [
    PB0: (pb0, 0, Input<Floating>, AFRL, exticr1),
    PB1: (pb1, 1, Input<Floating>, AFRL, exticr1),
    PB2: (pb2, 2, Input<Floating>, AFRL, exticr1),
    PB3: (pb3, 3, Input<Floating>, AFRL, exticr1),
    PB4: (pb4, 4, Input<Floating>, AFRL, exticr2),
    PB5: (pb5, 5, Input<Floating>, AFRL, exticr2),
    PB6: (pb6, 6, Input<Floating>, AFRL, exticr2),
    PB7: (pb7, 7, Input<Floating>, AFRL, exticr2),
    PB8: (pb8, 8, Input<Floating>, AFRH, exticr3),
    PB9: (pb9, 9, Input<Floating>, AFRH, exticr3),
    PB10: (pb10, 10, Input<Floating>, AFRH, exticr3),
    PB11: (pb11, 11, Input<Floating>, AFRH, exticr3),
    PB12: (pb12, 12, Input<Floating>, AFRH, exticr4),
    PB13: (pb13, 13, Input<Floating>, AFRH, exticr4),
    PB14: (pb14, 14, Input<Floating>, AFRH, exticr4),
    PB15: (pb15, 15, Input<Floating>, AFRH, exticr4),
]);

gpio!(GPIOC, gpioc, gpioc, gpiopcen, gpiocrst, PCx, 2, [
    PC0: (pc0, 0, Input<Floating>, AFRL, exticr1),
    PC1: (pc1, 1, Input<Floating>, AFRL, exticr1),
    PC2: (pc2, 2, Input<Floating>, AFRL, exticr1),
    PC3: (pc3, 3, Input<Floating>, AFRL, exticr1),
    PC4: (pc4, 4, Input<Floating>, AFRL, exticr2),
    PC5: (pc5, 5, Input<Floating>, AFRL, exticr2),
    PC6: (pc6, 6, Input<Floating>, AFRL, exticr2),
    PC7: (pc7, 7, Input<Floating>, AFRL, exticr2),
    PC8: (pc8, 8, Input<Floating>, AFRH, exticr3),
    PC9: (pc9, 9, Input<Floating>, AFRH, exticr3),
    PC10: (pc10, 10, Input<Floating>, AFRH, exticr3),
    PC11: (pc11, 11, Input<Floating>, AFRH, exticr3),
    PC12: (pc12, 12, Input<Floating>, AFRH, exticr4),
    PC13: (pc13, 13, Input<Floating>, AFRH, exticr4),
    PC14: (pc14, 14, Input<Floating>, AFRH, exticr4),
    PC15: (pc15, 15, Input<Floating>, AFRH, exticr4),
]);

gpio!(GPIOD, gpiod, gpioc, gpiopden, gpiodrst, PDx, 3, [
    PD0: (pd0, 0, Input<Floating>, AFRL, exticr1),
    PD1: (pd1, 1, Input<Floating>, AFRL, exticr1),
    PD2: (pd2, 2, Input<Floating>, AFRL, exticr1),
    PD3: (pd3, 3, Input<Floating>, AFRL, exticr1),
    PD4: (pd4, 4, Input<Floating>, AFRL, exticr2),
    PD5: (pd5, 5, Input<Floating>, AFRL, exticr2),
    PD6: (pd6, 6, Input<Floating>, AFRL, exticr2),
    PD7: (pd7, 7, Input<Floating>, AFRL, exticr2),
    PD8: (pd8, 8, Input<Floating>, AFRH, exticr3),
    PD9: (pd9, 9, Input<Floating>, AFRH, exticr3),
    PD10: (pd10, 10, Input<Floating>, AFRH, exticr3),
    PD11: (pd11, 11, Input<Floating>, AFRH, exticr3),
    PD12: (pd12, 12, Input<Floating>, AFRH, exticr4),
    PD13: (pd13, 13, Input<Floating>, AFRH, exticr4),
    PD14: (pd14, 14, Input<Floating>, AFRH, exticr4),
    PD15: (pd15, 15, Input<Floating>, AFRH, exticr4),
]);

#[cfg(any(feature = "stm32l151", feature = "stm32l152", feature = "stm32l162"))]
gpio!(GPIOE, gpioe, gpioc, gpiopeen, gpioerst, PEx, 4, [
    PE0: (pe0, 0, Input<Floating>, AFRL, exticr1),
    PE1: (pe1, 1, Input<Floating>, AFRL, exticr1),
    PE2: (pe2, 2, Input<Floating>, AFRL, exticr1),
    PE3: (pe3, 3, Input<Floating>, AFRL, exticr1),
    PE4: (pe4, 4, Input<Floating>, AFRL, exticr2),
    PE5: (pe5, 5, Input<Floating>, AFRL, exticr2),
    PE6: (pe6, 6, Input<Floating>, AFRL, exticr2),
    PE7: (pe7, 7, Input<Floating>, AFRL, exticr2),
    PE8: (pe8, 8, Input<Floating>, AFRH, exticr3),
    PE9: (pe9, 9, Input<Floating>, AFRH, exticr3),
    PE10: (pe10, 10, Input<Floating>, AFRH, exticr3),
    PE11: (pe11, 11, Input<Floating>, AFRH, exticr3),
    PE12: (pe12, 12, Input<Floating>, AFRH, exticr4),
    PE13: (pe13, 13, Input<Floating>, AFRH, exticr4),
    PE14: (pe14, 14, Input<Floating>, AFRH, exticr4),
    PE15: (pe15, 15, Input<Floating>, AFRH, exticr4),
]);

#[cfg(any(feature = "stm32l151", feature = "stm32l152", feature = "stm32l162"))]
gpio!(GPIOF, gpiof, gpioc, gpiopfen, gpiofrst, PFx, 5, [
    PF0: (pf0, 0, Input<Floating>, AFRL, exticr1),
    PF1: (pf1, 1, Input<Floating>, AFRL, exticr1),
    PF2: (pf2, 2, Input<Floating>, AFRL, exticr1),
    PF3: (pf3, 3, Input<Floating>, AFRL, exticr1),
    PF4: (pf4, 4, Input<Floating>, AFRL, exticr2),
    PF5: (pf5, 5, Input<Floating>, AFRL, exticr2),
    PF6: (pf6, 6, Input<Floating>, AFRL, exticr2),
    PF7: (pf7, 7, Input<Floating>, AFRL, exticr2),
    PF8: (pf8, 8, Input<Floating>, AFRH, exticr3),
    PF9: (pf9, 9, Input<Floating>, AFRH, exticr3),
    PF10: (pf10, 10, Input<Floating>, AFRH, exticr3),
    PF11: (pf11, 11, Input<Floating>, AFRH, exticr3),
    PF12: (pf12, 12, Input<Floating>, AFRH, exticr4),
    PF13: (pf13, 13, Input<Floating>, AFRH, exticr4),
    PF14: (pf14, 14, Input<Floating>, AFRH, exticr4),
    PF15: (pf15, 15, Input<Floating>, AFRH, exticr4),
]);

#[cfg(any(feature = "stm32l151", feature = "stm32l152", feature = "stm32l162"))]
gpio!(GPIOG, gpiog, gpioc, gpiopgen, gpiogrst, PGx, 6, [
    PG0: (pg0, 0, Input<Floating>, AFRL, exticr1),
    PG1: (pg1, 1, Input<Floating>, AFRL, exticr1),
    PG2: (pg2, 2, Input<Floating>, AFRL, exticr1),
    PG3: (pg3, 3, Input<Floating>, AFRL, exticr1),
    PG4: (pg4, 4, Input<Floating>, AFRL, exticr2),
    PG5: (pg5, 5, Input<Floating>, AFRL, exticr2),
    PG6: (pg6, 6, Input<Floating>, AFRL, exticr2),
    PG7: (pg7, 7, Input<Floating>, AFRL, exticr2),
    PG8: (pg8, 8, Input<Floating>, AFRH, exticr3),
    PG9: (pg9, 9, Input<Floating>, AFRH, exticr3),
    PG10: (pg10, 10, Input<Floating>, AFRH, exticr3),
    PG11: (pg11, 11, Input<Floating>, AFRH, exticr3),
    PG12: (pg12, 12, Input<Floating>, AFRH, exticr4),
    PG13: (pg13, 13, Input<Floating>, AFRH, exticr4),
    PG14: (pg14, 14, Input<Floating>, AFRH, exticr4),
    PG15: (pg15, 15, Input<Floating>, AFRH, exticr4),
]);

#[cfg(any(feature = "stm32l151", feature = "stm32l152", feature = "stm32l162"))]
gpio!(GPIOH, gpioh, gpioc, gpiophen, gpiohrst, PHx, 7, [
    PH0: (ph0, 0, Input<Floating>, AFRL, exticr1),
    PH1: (ph1, 1, Input<Floating>, AFRL, exticr1),
    PH2: (ph2, 2, Input<Floating>, AFRL, exticr1),
    PH3: (ph3, 3, Input<Floating>, AFRL, exticr1),
    PH4: (ph4, 4, Input<Floating>, AFRL, exticr2),
    PH5: (ph5, 5, Input<Floating>, AFRL, exticr2),
    PH6: (ph6, 6, Input<Floating>, AFRL, exticr2),
    PH7: (ph7, 7, Input<Floating>, AFRL, exticr2),
    PH8: (ph8, 8, Input<Floating>, AFRH, exticr3),
    PH9: (ph9, 9, Input<Floating>, AFRH, exticr3),
    PH10: (ph10, 10, Input<Floating>, AFRH, exticr3),
    PH11: (ph11, 11, Input<Floating>, AFRH, exticr3),
    PH12: (ph12, 12, Input<Floating>, AFRH, exticr4),
    PH13: (ph13, 13, Input<Floating>, AFRH, exticr4),
    PH14: (ph14, 14, Input<Floating>, AFRH, exticr4),
    PH15: (ph15, 15, Input<Floating>, AFRH, exticr4),
]);
